import numpy as np
from ase import Atoms
from ase.build import surface

# 주어진 POSCAR에서 원자 정보 추출
symbols = ['H', 'Pb', 'C', 'I', 'N']
positions = np.array([
    [0.267003, 0.500000, 0.701353],  # H+
    [0.267003, 0.500000, 0.298647],  # H+
    [0.692404, 0.500000, 0.500000],  # H+
    [0.518449, 0.500000, 0.191249],  # H+
    [0.518449, 0.500000, 0.808751],  # H+
    [0.964874, 0.000000, 0.000000],  # Pb2+
    [0.519831, 0.500000, 0.500000],  # C2+
    [0.983772, 0.000000, 0.500000],  # I-
    [0.462730, 0.000000, 0.000000],  # I-
    [0.920583, 0.500000, 0.000000],  # I-
    [0.426708, 0.500000, 0.319828],  # N3-
    [0.426708, 0.500000, 0.680172]   # N3-
])

# Atoms 객체 생성
atoms = Atoms(symbols=symbols, positions=positions)

# 단위 셀 벡터
cell = np.array([
    [6.3523719999999999, 0.0000000000000000, 0.0000000000000004],
    [0.0000000000000010, 6.4884300000000001, 0.0000000000000004],
    [0.0000000000000000, 0.0000000000000000, 6.5029800000000000]
])

# 111면 생성
slab = surface(atoms, (1, 1, 1), 10, vacuum=10)  # 여기서 10은 slab의 두께와 vacuum의 크기를 의미합니다.
slab.set_cell(cell, scale_atoms=True)

# 결과 확인
print(slab)

